scripts/load-test/results/ht03-50rps-3replicas-v2-log.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/load-test.js
        output: json (/scripts/results/ht03-50rps-3replicas-v2-raw.ndjson)

     scenarios: (100.00%) 1 scenario, 200 max VUs, 1m30s max duration (incl. graceful stop):
              * ht03_lectura_documentos: 50.00 iterations/s for 1m0s (maxVUs: 100-200, gracefulStop: 30s)


running (0m01.0s), 001/100 VUs, 49 complete and 0 interrupted iterations
ht03_lectura_documentos   [   2% ] 001/100 VUs  0m01.0s/1m0s  50.00 iters/s

running (0m02.0s), 001/100 VUs, 99 complete and 0 interrupted iterations
ht03_lectura_documentos   [   3% ] 001/100 VUs  0m02.0s/1m0s  50.00 iters/s

running (0m03.0s), 001/100 VUs, 149 complete and 0 interrupted iterations
ht03_lectura_documentos   [   5% ] 001/100 VUs  0m03.0s/1m0s  50.00 iters/s

running (0m04.0s), 001/100 VUs, 199 complete and 0 interrupted iterations
ht03_lectura_documentos   [   7% ] 001/100 VUs  0m04.0s/1m0s  50.00 iters/s

running (0m05.0s), 001/100 VUs, 249 complete and 0 interrupted iterations
ht03_lectura_documentos   [   8% ] 001/100 VUs  0m05.0s/1m0s  50.00 iters/s

running (0m06.0s), 001/100 VUs, 299 complete and 0 interrupted iterations
ht03_lectura_documentos   [  10% ] 001/100 VUs  0m06.0s/1m0s  50.00 iters/s

running (0m07.0s), 001/100 VUs, 349 complete and 0 interrupted iterations
ht03_lectura_documentos   [  12% ] 001/100 VUs  0m07.0s/1m0s  50.00 iters/s

running (0m08.0s), 001/100 VUs, 399 complete and 0 interrupted iterations
ht03_lectura_documentos   [  13% ] 001/100 VUs  0m08.0s/1m0s  50.00 iters/s

running (0m09.0s), 001/100 VUs, 449 complete and 0 interrupted iterations
ht03_lectura_documentos   [  15% ] 001/100 VUs  0m09.0s/1m0s  50.00 iters/s

running (0m10.0s), 001/100 VUs, 499 complete and 0 interrupted iterations
ht03_lectura_documentos   [  17% ] 001/100 VUs  0m10.0s/1m0s  50.00 iters/s

running (0m11.0s), 001/100 VUs, 549 complete and 0 interrupted iterations
ht03_lectura_documentos   [  18% ] 001/100 VUs  0m11.0s/1m0s  50.00 iters/s

running (0m12.0s), 001/100 VUs, 599 complete and 0 interrupted iterations
ht03_lectura_documentos   [  20% ] 001/100 VUs  0m12.0s/1m0s  50.00 iters/s

running (0m13.0s), 001/100 VUs, 649 complete and 0 interrupted iterations
ht03_lectura_documentos   [  22% ] 001/100 VUs  0m13.0s/1m0s  50.00 iters/s

running (0m14.0s), 001/100 VUs, 699 complete and 0 interrupted iterations
ht03_lectura_documentos   [  23% ] 001/100 VUs  0m14.0s/1m0s  50.00 iters/s

running (0m15.0s), 001/100 VUs, 749 complete and 0 interrupted iterations
ht03_lectura_documentos   [  25% ] 001/100 VUs  0m15.0s/1m0s  50.00 iters/s

running (0m16.0s), 001/100 VUs, 799 complete and 0 interrupted iterations
ht03_lectura_documentos   [  27% ] 001/100 VUs  0m16.0s/1m0s  50.00 iters/s

running (0m17.0s), 001/100 VUs, 849 complete and 0 interrupted iterations
ht03_lectura_documentos   [  28% ] 001/100 VUs  0m17.0s/1m0s  50.00 iters/s

running (0m18.0s), 001/100 VUs, 899 complete and 0 interrupted iterations
ht03_lectura_documentos   [  30% ] 001/100 VUs  0m18.0s/1m0s  50.00 iters/s

running (0m19.0s), 001/100 VUs, 949 complete and 0 interrupted iterations
ht03_lectura_documentos   [  32% ] 001/100 VUs  0m19.0s/1m0s  50.00 iters/s

running (0m20.0s), 001/100 VUs, 999 complete and 0 interrupted iterations
ht03_lectura_documentos   [  33% ] 001/100 VUs  0m20.0s/1m0s  50.00 iters/s

running (0m21.0s), 001/100 VUs, 1049 complete and 0 interrupted iterations
ht03_lectura_documentos   [  35% ] 001/100 VUs  0m21.0s/1m0s  50.00 iters/s

running (0m22.0s), 001/100 VUs, 1099 complete and 0 interrupted iterations
ht03_lectura_documentos   [  37% ] 001/100 VUs  0m22.0s/1m0s  50.00 iters/s

running (0m23.0s), 001/100 VUs, 1149 complete and 0 interrupted iterations
ht03_lectura_documentos   [  38% ] 001/100 VUs  0m23.0s/1m0s  50.00 iters/s

running (0m24.0s), 001/100 VUs, 1199 complete and 0 interrupted iterations
ht03_lectura_documentos   [  40% ] 001/100 VUs  0m24.0s/1m0s  50.00 iters/s

running (0m25.0s), 001/100 VUs, 1249 complete and 0 interrupted iterations
ht03_lectura_documentos   [  42% ] 001/100 VUs  0m25.0s/1m0s  50.00 iters/s

running (0m26.0s), 001/100 VUs, 1299 complete and 0 interrupted iterations
ht03_lectura_documentos   [  43% ] 001/100 VUs  0m26.0s/1m0s  50.00 iters/s

running (0m27.0s), 001/100 VUs, 1349 complete and 0 interrupted iterations
ht03_lectura_documentos   [  45% ] 001/100 VUs  0m27.0s/1m0s  50.00 iters/s

running (0m28.0s), 001/100 VUs, 1399 complete and 0 interrupted iterations
ht03_lectura_documentos   [  47% ] 001/100 VUs  0m28.0s/1m0s  50.00 iters/s

running (0m29.0s), 001/100 VUs, 1449 complete and 0 interrupted iterations
ht03_lectura_documentos   [  48% ] 001/100 VUs  0m29.0s/1m0s  50.00 iters/s

running (0m30.0s), 001/100 VUs, 1499 complete and 0 interrupted iterations
ht03_lectura_documentos   [  50% ] 001/100 VUs  0m30.0s/1m0s  50.00 iters/s

running (0m31.0s), 001/100 VUs, 1549 complete and 0 interrupted iterations
ht03_lectura_documentos   [  52% ] 001/100 VUs  0m31.0s/1m0s  50.00 iters/s

running (0m32.0s), 001/100 VUs, 1599 complete and 0 interrupted iterations
ht03_lectura_documentos   [  53% ] 001/100 VUs  0m32.0s/1m0s  50.00 iters/s

running (0m33.0s), 001/100 VUs, 1649 complete and 0 interrupted iterations
ht03_lectura_documentos   [  55% ] 001/100 VUs  0m33.0s/1m0s  50.00 iters/s

running (0m34.0s), 001/100 VUs, 1699 complete and 0 interrupted iterations
ht03_lectura_documentos   [  57% ] 001/100 VUs  0m34.0s/1m0s  50.00 iters/s

running (0m35.0s), 001/100 VUs, 1749 complete and 0 interrupted iterations
ht03_lectura_documentos   [  58% ] 001/100 VUs  0m35.0s/1m0s  50.00 iters/s

running (0m36.0s), 001/100 VUs, 1799 complete and 0 interrupted iterations
ht03_lectura_documentos   [  60% ] 001/100 VUs  0m36.0s/1m0s  50.00 iters/s

running (0m37.0s), 001/100 VUs, 1849 complete and 0 interrupted iterations
ht03_lectura_documentos   [  62% ] 001/100 VUs  0m37.0s/1m0s  50.00 iters/s

running (0m38.0s), 001/100 VUs, 1899 complete and 0 interrupted iterations
ht03_lectura_documentos   [  63% ] 001/100 VUs  0m38.0s/1m0s  50.00 iters/s

running (0m39.0s), 001/100 VUs, 1949 complete and 0 interrupted iterations
ht03_lectura_documentos   [  65% ] 001/100 VUs  0m39.0s/1m0s  50.00 iters/s

running (0m40.0s), 001/100 VUs, 1999 complete and 0 interrupted iterations
ht03_lectura_documentos   [  67% ] 001/100 VUs  0m40.0s/1m0s  50.00 iters/s

running (0m41.0s), 001/100 VUs, 2049 complete and 0 interrupted iterations
ht03_lectura_documentos   [  68% ] 001/100 VUs  0m41.0s/1m0s  50.00 iters/s

running (0m42.0s), 001/100 VUs, 2099 complete and 0 interrupted iterations
ht03_lectura_documentos   [  70% ] 001/100 VUs  0m42.0s/1m0s  50.00 iters/s

running (0m43.0s), 001/100 VUs, 2149 complete and 0 interrupted iterations
ht03_lectura_documentos   [  72% ] 001/100 VUs  0m43.0s/1m0s  50.00 iters/s

running (0m44.0s), 001/100 VUs, 2199 complete and 0 interrupted iterations
ht03_lectura_documentos   [  73% ] 001/100 VUs  0m44.0s/1m0s  50.00 iters/s

running (0m45.0s), 001/100 VUs, 2249 complete and 0 interrupted iterations
ht03_lectura_documentos   [  75% ] 001/100 VUs  0m45.0s/1m0s  50.00 iters/s

running (0m46.0s), 001/100 VUs, 2299 complete and 0 interrupted iterations
ht03_lectura_documentos   [  77% ] 001/100 VUs  0m46.0s/1m0s  50.00 iters/s

running (0m47.0s), 001/100 VUs, 2349 complete and 0 interrupted iterations
ht03_lectura_documentos   [  78% ] 001/100 VUs  0m47.0s/1m0s  50.00 iters/s

running (0m48.0s), 001/100 VUs, 2399 complete and 0 interrupted iterations
ht03_lectura_documentos   [  80% ] 001/100 VUs  0m48.0s/1m0s  50.00 iters/s

running (0m49.0s), 001/100 VUs, 2449 complete and 0 interrupted iterations
ht03_lectura_documentos   [  82% ] 001/100 VUs  0m49.0s/1m0s  50.00 iters/s

running (0m50.0s), 001/100 VUs, 2499 complete and 0 interrupted iterations
ht03_lectura_documentos   [  83% ] 001/100 VUs  0m50.0s/1m0s  50.00 iters/s

running (0m51.0s), 001/100 VUs, 2549 complete and 0 interrupted iterations
ht03_lectura_documentos   [  85% ] 001/100 VUs  0m51.0s/1m0s  50.00 iters/s

running (0m52.0s), 001/100 VUs, 2599 complete and 0 interrupted iterations
ht03_lectura_documentos   [  87% ] 001/100 VUs  0m52.0s/1m0s  50.00 iters/s

running (0m53.0s), 001/100 VUs, 2649 complete and 0 interrupted iterations
ht03_lectura_documentos   [  88% ] 001/100 VUs  0m53.0s/1m0s  50.00 iters/s

running (0m54.0s), 001/100 VUs, 2699 complete and 0 interrupted iterations
ht03_lectura_documentos   [  90% ] 001/100 VUs  0m54.0s/1m0s  50.00 iters/s

running (0m55.0s), 001/100 VUs, 2749 complete and 0 interrupted iterations
ht03_lectura_documentos   [  92% ] 001/100 VUs  0m55.0s/1m0s  50.00 iters/s

running (0m56.0s), 001/100 VUs, 2799 complete and 0 interrupted iterations
ht03_lectura_documentos   [  93% ] 001/100 VUs  0m56.0s/1m0s  50.00 iters/s

running (0m57.0s), 001/100 VUs, 2849 complete and 0 interrupted iterations
ht03_lectura_documentos   [  95% ] 001/100 VUs  0m57.0s/1m0s  50.00 iters/s

running (0m58.0s), 001/100 VUs, 2899 complete and 0 interrupted iterations
ht03_lectura_documentos   [  97% ] 001/100 VUs  0m58.0s/1m0s  50.00 iters/s

running (0m59.0s), 001/100 VUs, 2949 complete and 0 interrupted iterations
ht03_lectura_documentos   [  98% ] 001/100 VUs  0m59.0s/1m0s  50.00 iters/s

running (1m00.0s), 001/100 VUs, 2999 complete and 0 interrupted iterations
ht03_lectura_documentos   [ 100% ] 001/100 VUs  1m00.0s/1m0s  50.00 iters/s


  █ TOTAL RESULTS 

    checks_total.......: 6002    100.026611/s
    checks_succeeded...: 100.00% 6002 out of 6002
    checks_failed......: 0.00%   0 out of 6002

    ✓ status es 200
    ✓ cuerpo con forma esperada

    CUSTOM
    ht03_respuestas_por_instancia...: 3001   50.013306/s

    HTTP
    http_req_duration...............: avg=7ms   min=4.78ms med=6.67ms max=29.81ms p(90)=8.71ms p(95)=9.38ms p(99)=11.34ms
      { expected_response:true }....: avg=7ms   min=4.78ms med=6.67ms max=29.81ms p(90)=8.71ms p(95)=9.38ms p(99)=11.34ms
    http_req_failed.................: 0.00%  0 out of 3001
    http_reqs.......................: 3001   50.013306/s

    EXECUTION
    iteration_duration..............: avg=7.7ms min=5.41ms med=7.35ms max=31.33ms p(90)=9.53ms p(95)=10.3ms p(99)=12.13ms
    iterations......................: 3001   50.013306/s
    vus.............................: 0      min=0         max=1  
    vus_max.........................: 100    min=100       max=100

    NETWORK
    data_received...................: 9.2 MB 154 kB/s
    data_sent.......................: 1.3 MB 21 kB/s



running (1m00.0s), 000/100 VUs, 3001 complete and 0 interrupted iterations
ht03_lectura_documentos ✓ [ 100% ] 000/100 VUs  1m0s  50.00 iters/s